config/cf/DataProcessors/ФормированиеПароля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеПароля</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВключатьЦифры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьМаленькиеЛатинскиеБуквы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьБольшиеЛатинскиеБуквы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьМаленькиеРусскиеБуквы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьБольшиеРусскиеБуквы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьДругиеСимволы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСимволов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

config/cf/DataProcessors/ФормированиеПароля/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Если Параметры.Свойство("МассоваяГенерацияПаролей") Тогда
		Элементы.ГруппаПароль.Видимость = Параметры.МассоваяГенерацияПаролей = Ложь;
	КонецЕсли;
	
	Объект.КоличествоСимволов 				= ХранилищеНастроекДанныхФорм.Загрузить("ПАРОЛИ_КоличествоСимволовПаролейПоУмолчанию");
	Объект.ВключатьЦифры 					= ХранилищеНастроекДанныхФорм.Загрузить("ПАРОЛИ_ВключатьЦифры");
	Объект.ВключатьМаленькиеЛатинскиеБуквы	= ХранилищеНастроекДанныхФорм.Загрузить("ПАРОЛИ_ВключатьМаленькиеЛатинскиеБуквы");
	Объект.ВключатьБольшиеЛатинскиеБуквы	= ХранилищеНастроекДанныхФорм.Загрузить("ПАРОЛИ_ВключатьБольшиеЛатинскиеБуквы");
	Объект.ВключатьМаленькиеРусскиеБуквы	= ХранилищеНастроекДанныхФорм.Загрузить("ПАРОЛИ_ВключатьМаленькиеРусскиеБуквы");
	Объект.ВключатьБольшиеРусскиеБуквы		= ХранилищеНастроекДанныхФорм.Загрузить("ПАРОЛИ_ВключатьБольшиеРусскиеБуквы");
	Объект.ВключатьДругиеСимволы			= ХранилищеНастроекДанныхФорм.Загрузить("ПАРОЛИ_ВключатьДругиеСимволы");
	
	Если Объект.КоличествоСимволов = 0 Тогда
		
		Объект.КоличествоСимволов = 6;
		
	КонецЕсли;
	
	Если НЕ (Объект.ВключатьБольшиеЛатинскиеБуквы 
		ИЛИ Объект.ВключатьБольшиеРусскиеБуквы 
		ИЛИ Объект.ВключатьДругиеСимволы 
		ИЛИ Объект.ВключатьМаленькиеЛатинскиеБуквы 
		ИЛИ Объект.ВключатьМаленькиеРусскиеБуквы 
		ИЛИ Объект.ВключатьЦифры) Тогда
		
		Объект.ВключатьЦифры = Истина;
		
	КонецЕсли;
		
	Если НЕ (Объект.ВключатьЦифры 
		ИЛИ Объект.ВключатьМаленькиеЛатинскиеБуквы 
		ИЛИ Объект.ВключатьБольшиеЛатинскиеБуквы 
		ИЛИ Объект.ВключатьМаленькиеРусскиеБуквы 
		ИЛИ Объект.ВключатьБольшиеРусскиеБуквы 
		ИЛИ Объект.ВключатьДругиеСимволы) Тогда
		
		Объект.ВключатьЦифры = Истина;
		
	КонецЕсли;
	
	СформироватьПароль();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНастройкиНаСервере();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьПароль(Команда)
	
	СформироватьПароль();
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Структура = Новый Структура();
	Структура.Вставить("Пароль", 							Объект.Пароль);
	Структура.Вставить("ВключатьЦифры", 					Объект.ВключатьЦифры);
	Структура.Вставить("ВключатьМаленькиеЛатинскиеБуквы", 	Объект.ВключатьМаленькиеЛатинскиеБуквы);
	Структура.Вставить("ВключатьБольшиеЛатинскиеБуквы", 	Объект.ВключатьБольшиеЛатинскиеБуквы);
	Структура.Вставить("ВключатьМаленькиеРусскиеБуквы", 	Объект.ВключатьМаленькиеРусскиеБуквы);
	Структура.Вставить("ВключатьБольшиеРусскиеБуквы", 		Объект.ВключатьБольшиеРусскиеБуквы);
	Структура.Вставить("ВключатьДругиеСимволы", 			Объект.ВключатьДругиеСимволы);
	Структура.Вставить("КоличествоСимволов", 				Объект.КоличествоСимволов);
	
	Закрыть(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьПароль()
	
	Объект.Пароль = УправлениеITОтделом8УФ.СформироватьПароль(Объект);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	ХранилищеНастроекДанныхФорм.Сохранить("ПАРОЛИ_КоличествоСимволовПаролейПоУмолчанию",,Объект.КоличествоСимволов);
	ХранилищеНастроекДанныхФорм.Сохранить("ПАРОЛИ_ВключатьЦифры", ,Объект.ВключатьЦифры);
	ХранилищеНастроекДанныхФорм.Сохранить("ПАРОЛИ_ВключатьМаленькиеЛатинскиеБуквы", ,
		Объект.ВключатьМаленькиеЛатинскиеБуквы);
	ХранилищеНастроекДанныхФорм.Сохранить("ПАРОЛИ_ВключатьБольшиеЛатинскиеБуквы", ,Объект.ВключатьБольшиеЛатинскиеБуквы);
	ХранилищеНастроекДанныхФорм.Сохранить("ПАРОЛИ_ВключатьМаленькиеРусскиеБуквы", ,Объект.ВключатьМаленькиеРусскиеБуквы);
	ХранилищеНастроекДанныхФорм.Сохранить("ПАРОЛИ_ВключатьБольшиеРусскиеБуквы", ,Объект.ВключатьБольшиеРусскиеБуквы);
	ХранилищеНастроекДанныхФорм.Сохранить("ПАРОЛИ_ВключатьДругиеСимволы", ,Объект.ВключатьДругиеСимволы);
	ХранилищеНастроекДанныхФорм.Сохранить("ПАРОЛИ_КоличествоСимволовПаролейПоУмолчанию", ,Объект.КоличествоСимволов);
	
КонецПроцедуры

#КонецОбласти
